/*
   Ôóíêöèè äëÿ ïîëó÷åíèÿ ğåçóëüòàòîâ ıêñïğåññ-òåñòîâ

   Äëÿ ïîëó÷åíèÿ îáîáùåííîé èíôîğìàöèè î íåèñïğàâíîñòÿõ îáíàğóæåííûõ âî âğåìÿ ïğîâåäåíèÿ ıêñïğåññ òåñòèğîâàíèÿ íóæíî ñ÷èòàòü èíôîğìàöèş ñ àäğåñà óêàçàííîãî â startExpTstInfo, ğàçìåğ ñôîğìèğîâàííîãî ìàññèâà âû÷èñëÿåòñÿ ñëåäóşùèì îáğàçîì:
FreeExpTstInfo - startExpTstInfo
*/

#include "exptst.h"
/*
 ôóíêöèÿ äëÿ ïîëó÷åíèÿ îáîáùåííîé èíôîğìàöèè î ïğîõîæäåíèè ıêñïğåññ òåñòîâ
 Ôóíêöèÿ âîçâğàùàåò óêàçàòåëü íà çàïîëíåííóş ñòğóêòóğó òèïà State_t, ñîäåğæàùóş èíôîğìàöèş î ïğîâåäåííûõ òåñòàõ
*/
State_t * exptstGetState(void)
{  
  return (State_t *)AREA_FOR_EXPTST_INFO_ADR;
}

/*
 ôóíêöèÿ äëÿ ïîëó÷åíèÿ ğåçóëüòàòîâ òåñòîâ
Ôóíêöèÿ âîçâğàùàåò Áèòîâûé âåêòîğ ğåçóëüòàòîâ ıêñïğåññ-òåñòîâ.
*/
unsigned exptstGetResult(void)
{
 State_t* state = (State_t *)AREA_FOR_EXPTST_INFO_ADR;
 return state->err[0];
}



